// створюю масив list у який вкладаю всі елементи з классом .item
const list = document.querySelectorAll('.item')
// виводжу в консоль за допомогою шаблонної строки кількість категорій із классом.item,
//підраховуючи довжини створеного масиву list
console.log(`Кількість категорій: ${list.length}`)

// створюю масив ul у який вкладаю елементи, що підпорядковуються списку з id = "categories",
// та входять в состав елементів із классом .item
const ul = document.querySelectorAll('#categories>li')
console.log('🚀 ~ file: task-01.js:10 ~ ul', ul)
// за допоиогою методу forEach розкладаю масив на елементи та виводжу в консоль за допомогою
// щаблонної строки текстові данні, звертаючись при кожному проходженні циклу до першого
// елементу в масиві(заголовку категорії), та кількість(довжину масиву) вкладених пунктів
// категорії
ul.forEach((el) => {
    console.log(
        `Категорія: ${el.firstElementChild.textContent}, 
        Кількість елементів: ${el.lastElementChild.children.length}`
    )
})
